In [1]:
import pandas as pd
import numpy as np

In [5]:
user_data={"marks A": np.random.randint(1,100,5),
           "marks B": np.random.randint(1,100,5),
           "marks c": np.random.randint(1,100,5),
          }

In [6]:
user_data

{'marks A': array([72, 93, 11, 45, 55]),
 'marks B': array([70, 32, 84,  2, 44]),
 'marks c': array([92, 13, 24, 78, 88])}

In [7]:
df=pd.DataFrame(user_data)

In [8]:
df

   marks A  marks B  marks c
0       72       70       92
1       93       32       13
2       11       84       24
3       45        2       78
4       55       44       88

In [9]:
df.head(n=3)

   marks A  marks B  marks c
0       72       70       92
1       93       32       13
2       11       84       24

In [10]:
print(df.columns)

Index(['marks A', 'marks B', 'marks c'], dtype='object')

In [11]:
df.to_csv('marks.csv')

In [15]:
my_data=pd.read_csv('marks.csv')

In [16]:
my_data

   Unnamed: 0  marks A  marks B  marks c
0           0       72       70       92
1           1       93       32       13
2           2       11       84       24
3           3       45        2       78
4           4       55       44       88

In [22]:
my_data=my_data.drop(columns=['Unnamed: 0'])
my_data

   marks A  marks B  marks c
0       72       70       92
1       93       32       13
2       11       84       24
3       45        2       78
4       55       44       88

In [23]:
my_data.describe()

         marks A   marks B    marks c
count   5.000000   5.00000   5.000000
mean   55.200000  46.40000  59.000000
std    30.695277  32.23042  37.523326
min    11.000000   2.00000  13.000000
25%    45.000000  32.00000  24.000000
50%    55.000000  44.00000  78.000000
75%    72.000000  70.00000  88.000000
max    93.000000  84.00000  92.000000

In [24]:
my_data.tail(n=3)

   marks A  marks B  marks c
2       11       84       24
3       45        2       78
4       55       44       88

In [25]:
df.iloc[3]

marks A    45
marks B     2
marks c    78
Name: 3, dtype: int32

In [27]:
df.iloc[3,2]

78

In [28]:
df.iloc[3][1]

2

In [31]:
idx=df.columns.get_loc('marks B')

In [32]:
idx

1

In [34]:
df.iloc[3,idx]

2

In [35]:
df.iloc[:3,idx]

0    70
1    32
2    84
Name: marks B, dtype: int32

In [36]:
df.iloc[:3,[1,2]]

   marks B  marks c
0       70       92
1       32       13
2       84       24

In [37]:
#sort data frame

In [38]:
my_data

   marks A  marks B  marks c
0       72       70       92
1       93       32       13
2       11       84       24
3       45        2       78
4       55       44       88

In [39]:
my_data.sort_values(by=["marks A"])

   marks A  marks B  marks c
2       11       84       24
3       45        2       78
4       55       44       88
0       72       70       92
1       93       32       13

In [41]:
my_data.sort_values(by=["marks A"],ascending=False)

   marks A  marks B  marks c
1       93       32       13
0       72       70       92
4       55       44       88
3       45        2       78
2       11       84       24

In [42]:
data_array=my_data.values

In [43]:
data_array

array([[72, 70, 92],
       [93, 32, 13],
       [11, 84, 24],
       [45,  2, 78],
       [55, 44, 88]], dtype=int64)

In [44]:
data_array[2][2]

24

In [45]:
new_df=pd.DataFrame(data_array,dtype='int32',columns=["physics","chem","marks"])

In [46]:
new_df

   physics  chem  marks
0       72    70     92
1       93    32     13
2       11    84     24
3       45     2     78
4       55    44     88

In [48]:
new_df.to_csv("PCM.csv",index=False)

In [49]:
PCM=pd.read_csv('PCM.csv')

In [50]:
PCM

   physics  chem  marks
0       72    70     92
1       93    32     13
2       11    84     24
3       45     2     78
4       55    44     88